In [7]:
import pandas as pd

url = 'https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/fa71405126017e6a37bea592440b4bee94bf7b9e/titanic.csv'


dataframe = pd.read_csv(url)

dataframe.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
dataframe.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# Creating a Data Frame

You want to create a new data frame

In [4]:
dataframe = pd.DataFrame()

dataframe['Name'] = ['Jacky Perez', 'Juan perez']
dataframe['Age'] = [38,25]
dataframe['Driver'] = [True, False]

dataframe

          Name  Age  Driver
0  Jacky Perez   38    True
1   Juan perez   25   False

In [6]:
new_person = pd.Series(['Molly Mooney',40,True], index=['Name','Age','Driver'])
dataframe.append(new_person, ignore_index=True)

           Name  Age  Driver
0   Jacky Perez   38    True
1    Juan perez   25   False
2  Molly Mooney   40    True

# Describing the Data

# you want to view some characteristics of a DataFrame.

In [7]:
dataframe.shape

(2, 3)

In [12]:
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

# Navigating DataFrames

You need to select individual data or slices of a DataFrame

In [8]:


dataframe = pd.read_csv(url)

dataframe.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [14]:
dataframe.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [11]:
dataframe.iloc[:4]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [12]:
dataframe = dataframe.set_index(dataframe['Name'])

dataframe.loc['Braund, Mr. Owen Harris']

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: Braund, Mr. Owen Harris, dtype: object

# Selecting Rows Based on Conditionals

In [2]:
url = 'https://tinyurl.com/titanic-csv'

dataframe = pd.read_csv(url)

dataframe[dataframe['Sex'] == 'female'].head(3)

NameError: name 'pd' is not defined

In [8]:
dataframe[(dataframe['Sex']=='female')&(dataframe['Age']>=65)]

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

# Replacing Values

In [6]:
url = 'https://tinyurl.com/titanic-csv'

dataframe = pd.read_csv(url)

dataframe['Sex'].replace("female","Woman").head(5)

0    Woman
1    Woman
2     male
3    Woman
4     male
Name: Sex, dtype: object

In [11]:
dataframe['Sex'].replace(["Woman","Man"],["male","Woman"]).head(5)

0    female
1    female
2      male
3    female
4      male
Name: Sex, dtype: object

# Renaming Columns

In [12]:
url = 'https://tinyurl.com/titanic-csv'

dataframe = pd.read_csv(url)

dataframe.rename(columns={'PClass': 'Passenger Class'}).head(2)

,Name,Passenger Class,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [14]:
dataframe.rename(columns={'PClass':'Passenger Class','Sex':'Gender'}).head(2)

,Name,Passenger Class,Age,Gender,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [15]:
import collections 

column_names = collections.defaultdict(str)

for name in dataframe.columns:
    column_names[name]
    
column_names

defaultdict(str,
            {'Name': '',
             'PClass': '',
             'Age': '',
             'Sex': '',
             'Survived': '',
             'SexCode': ''})

# Finding the Minimun, Maximun, Sum, Avergae and Count

In [3]:
#load library
import pandas as pd
# Create URL
url = 'https://tinyurl.com/titanic-csv'
#Load Data
dataframe = pd.read_csv(url)

print('Maximum',dataframe['Age'].max())
print('Minimum',dataframe['Age'].min())
print('Mean',dataframe['Age'].mean())
print('Sum',dataframe['Age'].sum())
print('Count',dataframe['Age'].count())

Maximum 71.0
Minimum 0.17
Mean 30.397989417989415
Sum 22980.88
Count 756

In [18]:
dataframe.count()

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

# Finding Unique Values

In [19]:
# Create URL
url = 'https://tinyurl.com/titanic-csv'
#Load Data
dataframe = pd.read_csv(url)

dataframe['Sex'].unique()

array(['female', 'male'], dtype=object)

In [20]:
dataframe['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [21]:
dataframe['PClass'].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

In [22]:
dataframe['PClass'].nunique()

4

# Handling Missing Values

In [4]:
url = 'https://tinyurl.com/titanic-csv'
#Load Data
dataframe = pd.read_csv(url)

dataframe[dataframe['Age'].isnull()].head(2)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

In [5]:
dataframe['Sex'] = dataframe['Sex'].replace('male',NaN)

NameError: name 'NaN' is not defined

In [14]:
import numpy as np
dataframe['Sex'] = dataframe['Sex'].replace('male',np.nan)

In [15]:
dataframe = pd.read_csv(url, na_values=[np.nan,'None',-999])

In [16]:
dataframe

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q